{
    "template": {
        "emoji": "📦",
        "label": "Template",
        "description": "This is the Template Pack. You need to download it first and insert all the Addons that you download into it. If you need assistance, feel free to consult the 'Help' Button in the top right or come to our Discord server for questions.",
        "link": null
    },
    "rpmcpatcher": {
        "emoji": "🩹",
        "label": "Requires Right Proper MCPatcher",
        "description": "This Addon requires FalsePattern's and Venn's Right Proper MCPatcher, a new and improved implementation of the MCPatcher functionality from OptiFine for Minecraft 1.7.10.",
        "link": "https://github.com/vfx-dev/Right-Proper-MCPatcher"
    },
    "optifine": {
        "emoji": "🔎",
        "label": "Requires OptiFine",
        "description": "This Addon Requires OptiFine.",
        "link": "https://optifine.net/downloads"
    },
    "optifinecompatible": {
        "emoji": "🤝",
        "label": "OptiFine-compatible",
        "description": "This Addon is compatible with OptiFine. Note that some Addons make use of functionality that is not available in OptiFine, but it instead provided for by other, similar mods. Modernity Addon Hub generally discourages the use of OptiFine, if better solutions are available, though if you do decide to make use of it, be sure that you download the right version.",
        "link": null
    },
    "optifineincompatible": {
        "emoji": "⚠️",
        "label": "OptiFine-incompatible",
        "description": "This Addon is not compatible with OptiFine. That means that the functionality that is necessary to make this Addon function is simply not provided by OptiFine and instead requires another mod.",
        "link": null
    },
    "vanillacompatible": {
        "emoji": "🍦",
        "label": "Vanilla-compatible",
        "description": "This Addon does not require additional mods to function, as their changes are purely based on the already present vanilla Texture Pack capabilities.",
        "link": null
    },
    "animated": {
        "emoji": "🎞️",
        "label": "Animated",
        "description": "This Addon contains animated textures.",
        "link": null
    },
    "interpolated1710": {
        "emoji": "🧩",
        "label": "Interpolated",
        "description": "This Addon contains animated textures that are interpolated. This means that the individual frames of the texture blend together. Note that for version 1.7.10, jss2a98aj's NotFine is required for this to work.",
        "link": "https://github.com/jss2a98aj/NotFine"
    },
    "interpolated18": {
        "emoji": "🧩",
        "label": "Interpolated",
        "description": "This Addon contains animated textures that are interpolated. This means that the individual frames of the texture blend together.",
        "link": null
    },
    "completeconnection": {
        "emoji": "🖼️",
        "label": "Complete Connection",
        "description": "This Addon connects the textures completely, making use of the 'ctm' method. For more information, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "horizontalconnection": {
        "emoji": "🚥",
        "label": "Horizontal Connection",
        "description": "This Addon connects the textures horizontally, making use of the 'horizontal' method. For more information, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "verticalconnection": {
        "emoji": "🚦",
        "label": "Vertical Connection",
        "description": "This Addon connects the textures vertically, making use of the 'vertical' method. For more information, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "2siderotation": {
        "emoji": "2️⃣",
        "label": "2-Side Rotation",
        "description": "This Addon rotates its textures in two directions, usually 180° from each other. For more information, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "4siderotation": {
        "emoji": "4️⃣",
        "label": "4-Side Rotation",
        "description": "This Addon rotates its textures in four directions, usually 90° from each other. For more information, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "mixedrotation": {
        "emoji": "🔢",
        "label": "Mixed Rotation",
        "description": "This Addon uses mixed forms of rotation, sometimes 2-Side Rotation, sometimes 4-Side Rotation. For more information, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "minetweaker": {
        "emoji": "🔁",
        "label": "Requires MineTweaker/CraftTweaker",
        "description": "This Addon requires MineTweaker/CraftTweaker to work, because it makes use of special crafting recipes that create items with special textures. Be sure that you download the right version.",
        "link": "https://modrinth.com/mod/crafttweaker"
    },
    "script": {
        "emoji": "📜",
        "label": "Includes Script",
        "description": "This Addon automatically downloads a secondary package that includes a MineTweaker/CraftTweaker script for additional recipes. If you have trouble finding where to put the script, feel free to consult the 'Documentation' button in the top right.",
        "link": null
    },
    "mod": {
        "emoji": "🛠️",
        "label": "Includes Mod",
        "description": "This Addon automatically downloads a small mod that is either required for the Addon to function or for providing immersion.",
        "link": null
    }
}
